; domain
(define (domain emergency-carrier)
    (:requirements :strips :typing)

    (:types
        drone person crate location content carrier num
    )

    (:predicates
        ;; Localización
        (at-drone ?d - drone ?l - location)
        (at-person ?p - person ?l - location)
        (at-crate ?c - crate ?l - location)
        (at-carrier ?ca - carrier ?l - location)

        ;; Estado del dron
        (holding ?d - drone ?c - crate)
        (drone-free ?d - drone)

        ;; Transportador
        (carrying ?d - drone ?ca - carrier)

        ;; Contenido
        (crate-has ?c - crate ?t - content)
        (person-has ?p - person ?t - content)

        ;; Cajas dentro del transportador
        (in ?c - crate ?ca - carrier)

        ;; Control numérico
        (carrier-load ?ca - carrier ?n - num)
        (carrier-capacity ?ca - carrier ?n - num)
        (siguiente ?n1 ?n2 - num)
    )

    ;; -----------------------------
    ;; MOVER DRON SOLO
    ;; -----------------------------

    (:action fly
        :parameters (?d - drone ?from - location ?to - location)
        :precondition (at-drone ?d ?from)
        :effect (and
            (not (at-drone ?d ?from))
            (at-drone ?d ?to)
        )
    )

    ;; -----------------------------
    ;; COGER TRANSPORTADOR
    ;; -----------------------------

    (:action pick-up-carrier
        :parameters (?d - drone ?ca - carrier ?l - location)
        :precondition (and
            (at-drone ?d ?l)
            (at-carrier ?ca ?l)
        )
        :effect (and
            (not (at-carrier ?ca ?l))
            (carrying ?d ?ca)
        )
    )

    ;; -----------------------------
    ;; DEJAR TRANSPORTADOR
    ;; -----------------------------

    (:action drop-carrier
        :parameters (?d - drone ?ca - carrier ?l - location)
        :precondition (and
            (at-drone ?d ?l)
            (carrying ?d ?ca)
        )
        :effect (and
            (not (carrying ?d ?ca))
            (at-carrier ?ca ?l)
        )
    )

    ;; -----------------------------
    ;; MOVER TRANSPORTADOR
    ;; -----------------------------

    (:action fly-and-move-carrier
        :parameters (?d - drone ?ca - carrier ?from - location ?to - location)
        :precondition (and
            (at-drone ?d ?from)
            (carrying ?d ?ca)
        )
        :effect (and
            (not (at-drone ?d ?from))
            (at-drone ?d ?to)
        )
    )

    ;; -----------------------------
    ;; COGER CAJA
    ;; -----------------------------

    (:action pick-up
        :parameters (?d - drone ?c - crate ?l - location)
        :precondition (and
            (at-drone ?d ?l)
            (at-crate ?c ?l)
            (drone-free ?d)
        )
        :effect (and
            (not (at-crate ?c ?l))
            (not (drone-free ?d))
            (holding ?d ?c)
        )
    )

    ;; -----------------------------
    ;; PONER CAJA EN TRANSPORTADOR
    ;; -----------------------------

    (:action put-in-carrier
        :parameters (?d - drone ?c - crate ?ca - carrier ?l - location ?n1 ?n2 - num)
        :precondition (and
            (at-drone ?d ?l)
            (carrying ?d ?ca)
            (holding ?d ?c)
            (carrier-load ?ca ?n1)
            (carrier-capacity ?ca ?n2)
            (siguiente ?n1 ?n2)
        )
        :effect (and
            (not (holding ?d ?c))
            (drone-free ?d)
            (in ?c ?ca)
            (not (carrier-load ?ca ?n1))
            (carrier-load ?ca ?n2)
        )
    )

    ;; -----------------------------
    ;; SACAR CAJA DEL TRANSPORTADOR
    ;; -----------------------------

    (:action take-from-carrier
        :parameters (?d - drone ?c - crate ?ca - carrier ?l - location ?n1 ?n2 - num)
        :precondition (and
            (at-drone ?d ?l)
            (carrying ?d ?ca)
            (in ?c ?ca)
            (carrier-load ?ca ?n2)
            (siguiente ?n1 ?n2)
            (drone-free ?d)
        )
        :effect (and
            (holding ?d ?c)
            (not (drone-free ?d))
            (not (in ?c ?ca))
            (not (carrier-load ?ca ?n2))
            (carrier-load ?ca ?n1)
        )
    )

    ;; -----------------------------
    ;; ENTREGAR
    ;; -----------------------------

    (:action deliver
        :parameters (?d - drone ?c - crate ?p - person ?l - location ?t - content)
        :precondition (and
            (at-drone ?d ?l)
            (holding ?d ?c)
            (at-person ?p ?l)
            (crate-has ?c ?t)
        )
        :effect (and
            (person-has ?p ?t)
            (not (holding ?d ?c))
            (drone-free ?d)
        )
    )

)

; problem
(define (problem emergency_carrier_d1_r1_l10_p10_c4_g4)
(:domain emergency-carrier)
(:objects
	drone1 - drone
	carrier1 - carrier
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	n0 - num
	n1 - num
	n2 - num
	n3 - num
	n4 - num
)
(:init
	(at-drone drone1 depot)
	(drone-free drone1)
	(at-carrier carrier1 depot)
	(carrier-load carrier1 n0)
	(carrier-capacity carrier1 n4)
	(siguiente n0 n1)
	(siguiente n1 n2)
	(siguiente n2 n3)
	(siguiente n3 n4)
	(at-crate crate1 depot)
	(at-crate crate2 depot)
	(at-crate crate3 depot)
	(at-crate crate4 depot)
	(crate-has crate1 food)
	(crate-has crate2 food)
	(crate-has crate3 medicine)
	(crate-has crate4 medicine)
	(at-person person1 loc1)
	(at-person person2 loc4)
	(at-person person3 loc1)
	(at-person person4 loc5)
	(at-person person5 loc2)
	(at-person person6 loc5)
	(at-person person7 loc9)
	(at-person person8 loc7)
	(at-person person9 loc10)
	(at-person person10 loc8)
)
(:goal (and
	(at-drone drone1 depot)
	(person-has person3 food)
	(person-has person7 food)
	(person-has person8 medicine)
	(person-has person9 medicine)
))
)

; plan
1. (pick-up drone1 crate4 depot)
   deleted: (at-crate crate4 depot) (drone-free drone1)
   added: (holding drone1 crate4)
   goals met: 1 of 5
2. (pick-up-carrier drone1 carrier1 depot)
   deleted: (at-carrier carrier1 depot)
   added: (carrying drone1 carrier1)
   goals met: 1 of 5
3. (fly-and-move-carrier drone1 carrier1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 0 of 5
4. (deliver drone1 crate4 person9 loc10 medicine)
   deleted: (holding drone1 crate4)
   added: (person-has person9 medicine) (drone-free drone1)
   goals met: 1 of 5
5. (fly-and-move-carrier drone1 carrier1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 2 of 5
6. (pick-up drone1 crate3 depot)
   deleted: (at-crate crate3 depot) (drone-free drone1)
   added: (holding drone1 crate3)
   goals met: 2 of 5
7. (fly-and-move-carrier drone1 carrier1 depot loc7)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc7)
   goals met: 1 of 5
8. (deliver drone1 crate3 person8 loc7 medicine)
   deleted: (holding drone1 crate3)
   added: (person-has person8 medicine) (drone-free drone1)
   goals met: 2 of 5
9. (fly-and-move-carrier drone1 carrier1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 3 of 5
10. (pick-up drone1 crate2 depot)
   deleted: (at-crate crate2 depot) (drone-free drone1)
   added: (holding drone1 crate2)
   goals met: 3 of 5
11. (fly-and-move-carrier drone1 carrier1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 2 of 5
12. (deliver drone1 crate2 person7 loc9 food)
   deleted: (holding drone1 crate2)
   added: (person-has person7 food) (drone-free drone1)
   goals met: 3 of 5
13. (fly-and-move-carrier drone1 carrier1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 4 of 5
14. (pick-up drone1 crate1 depot)
   deleted: (at-crate crate1 depot) (drone-free drone1)
   added: (holding drone1 crate1)
   goals met: 4 of 5
15. (fly-and-move-carrier drone1 carrier1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 3 of 5
16. (deliver drone1 crate1 person3 loc1 food)
   deleted: (holding drone1 crate1)
   added: (person-has person3 food) (drone-free drone1)
   goals met: 4 of 5
17. (fly-and-move-carrier drone1 carrier1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 5 of 5
